# ===============================================================
#                     Инструкция по запуску
# ===============================================================
# Этот скрипт отправляет SMS на указанный номер из app2.py
# (переменная mobile_number) через сервис Textbelt.
#
# - Функция send_message() делает POST-запрос и выводит результат.
# - Планировщик schedule запускает функцию по расписанию:
#   • для теста — каждые 10 секунд
#   • можно изменить на ежедневную отправку в 06:00
# - Главный цикл while True поддерживает работу планировщика.
#
# 1. Создать виртуальное окружение:
#    python -m venv my_env
#
#    • Windows:     my_env\Scripts\activate
#    • Linux/macOS: source my_env/bin/activate
#
# 2. Установить зависимости:
#    pip install -r requirements.txt
#    (requests, schedule)
#
# 3. Запустить скрипт:
#    python automation.py
# ===============================================================

# Номер и API ключ берём из отдельного файла
from app2 import mobile_number, textbelt_api_key
import requests
import schedule
import time

def send_message():
    resp = requests.post("https://textbelt.com/text", {
        "phone": mobile_number,
        "message": "Доброе утро! Пусть кофе будет вкусным, а настроение улётным ☕😆.",
        "key": textbelt_api_key
    })

    print(resp.json())

# schedule.every().day.at("06:00").do(send_message)
schedule.every(10).seconds.do(send_message)

while True:
    schedule.run_pending()
    time.sleep(1)