# ===============================================================
#                     Инструкция по запуску
# ===============================================================
# ⚠ Рекомендация по Python:
# OpenCV может не устанавливаться на самых новых версиях Python
# (например, 3.14.x). Надёжные версии: Python 3.10 или 3.11.
#
# 1. Создать виртуальное окружение:
#    python -m venv my_env
#
#    • Windows:     my_env\Scripts\activate
#    • Linux/macOS: source my_env/bin/activate
#
# 2. Установить зависимости:
#    pip install -r requirements.txt
#    (opencv-python)
#
# 3. Запустить скрипт:
#    python face_detection.py
#
# После запуска появится окно с обнаруженными лицами,
# а результат сохранится в файле face_detected.jpg.
#
# Скрипт может распознавать любое количество лиц,
# если они достаточно крупные и хорошо видны на изображении.
#
# P.S. На фото — стример dasha228play 🫶🏻❤️
# Подписывайтесь: https://www.twitch.tv/dasha228play
# ===============================================================

import cv2

face_cascade = cv2.CascadeClassifier("haarcascade_frontalface_default.xml")
img = cv2.imread("images/test.jpg")
gray = cv2.cvtColor(img, cv2.COLOR_RGB2GRAY)
faces = face_cascade.detectMultiScale(gray, 1.1, 4)

for (x, y, w, h) in faces:
   cv2.rectangle(img, (x, y), (x + w, y + h), (225, 0, 0), 2)

cv2.imshow("img", img)
cv2.waitKey()
cv2.imwrite("face_detected.jpg", img)